Tekla Open API Reference for Tekla Structures 2025
BendSurfaceNode.Surface Property
 Gets the bend surface geometry.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BendSurface Surface { get; }
Public ReadOnly Property Surface As BendSurface
	Get
Property Value
Type: BendSurface
See Also
Reference
BendSurfaceNode Class
Tekla.Structures.Model Namespace